In [1]:
import pandas as pd
import numpy as np
import os
mydataset = {
  "Name":["Praveen","Kavitha","Keetrthi"],
  "Mob Number":["9880032253","8733222888","7775588566"]
}

a=[1,2,3,4,5]
myvar = pd.DataFrame(mydataset)
x=pd.Series(a,index=range(1,6))
print(myvar)

       Name  Mob Number
0   Praveen  9880032253
1   Kavitha  8733222888
2  Keetrthi  7775588566

In [2]:
a=np.arange(30,40)
d=np.arange(50,60)
c=np.arange(1,len(a)+1)
b=pd.Series(d,index=c)
print(b)

1     50
2     51
3     52
4     53
5     54
6     55
7     56
8     57
9     58
10    59
dtype: int32

In [3]:
import pandas as pd
let=" abcdefghijklmnopqrstuvwxyz".upper()
a=dict()
for i in range(1,26):
    s=let[i]
    a[s]=i
v=pd.Series(a)
print(v)

A     1
B     2
C     3
D     4
E     5
F     6
G     7
H     8
I     9
J    10
K    11
L    12
M    13
N    14
O    15
P    16
Q    17
R    18
S    19
T    20
U    21
V    22
W    23
X    24
Y    25
dtype: int64

In [4]:
import pandas as pd
import numpy as np
let=np.array(["Name","Mobile Number:","Experiance","Designation","Location"])
Details=np.array(["Praveen","9880032253","4 years","Validation Engineer","Bangalore"])
a=dict()
for i in range(0,len(let)):
    s=let[i]
    a[s]=Details[i]
v=pd.Series(a)
z=pd.DataFrame(v)
print(z)

                                  0
Name                        Praveen
Mobile Number:           9880032253
Experiance                  4 years
Designation     Validation Engineer
Location                  Bangalore

In [5]:
import pandas as pd
import numpy as np
l=dict()
for i in range(0,2):
    j=input("Enter heading")
    l[j]=input("Enter the answer")
c=pd.Series(l)
x=pd.DataFrame(c)
print(x)

Enter headingsjjs
Enter the answerssk
Enter headingsks
Enter the answerskks
         0
sjjs   ssk
sks   skks

In [6]:
a=np.array([1,2,3,4,4,5,5,6,6,7,8,8])
print(pd.DataFrame(a))

    0
0   1
1   2
2   3
3   4
4   4
5   5
6   5
7   6
8   6
9   7
10  8
11  8

In [7]:
liss=[10,24,2,3,4,5,66,3,4]
print(pd.DataFrame(liss))

    0
0  10
1  24
2   2
3   3
4   4
5   5
6  66
7   3
8   4

In [8]:
import pandas as pd
liss1=[{"Name":"Praveen","Mobile Number":"9880032253"}, {"Name":"Kavitha","Mobile Number":"8722457566"}
      ,{"Name":"Keerthi","Mobile Number":"6856205525"},{"Name":"Teju","Mobile Number":"7855755865"}]
c=pd.DataFrame(liss1)
d=pd.DataFrame(liss1)
print(c)
print("\n")
print(d)

      Name Mobile Number
0  Praveen    9880032253
1  Kavitha    8722457566
2  Keerthi    6856205525
3     Teju    7855755865


      Name Mobile Number
0  Praveen    9880032253
1  Kavitha    8722457566
2  Keerthi    6856205525
3     Teju    7855755865

In [9]:
import pandas as pd

a=["hello","How","Are","You"]

b=[1,2,3,4]

print(pd.Series(a))
pd.DataFrame(a)

0    hello
1      How
2      Are
3      You
dtype: object

       0
0  hello
1    How
2    Are
3    You

In [10]:
import pandas as pd

n=[["Name","Age"],["Praveen",23],["Akshatha",22],["Keerthi",23],["Teju",19]]

pd.DataFrame(n,index=[1,2,3,4,5])

          0    1
1      Name  Age
2   Praveen   23
3  Akshatha   22
4   Keerthi   23
5      Teju   19

In [11]:
import pandas as pd

n=[["Name","Age"],["Praveen",23],["Akshatha",22],["Keerthi",23],["Teju",19]]

pd.DataFrame(n,index=range(1,len(n)+1))

          0    1
1      Name  Age
2   Praveen   23
3  Akshatha   22
4   Keerthi   23
5      Teju   19

In [12]:
import pandas as pd
x="abcde"
data={"head":pd.Series([1,2,3,4,5],index=range(1,6)),
      "Details":pd.Series([5,6,7,8,9],index=range(1,6))}
print(pd.DataFrame(data))

data={"head":pd.Series([1,2,3,4,5],index=(i for i in x)),
      "Details":pd.Series([5,6,7,8,9],index=(i for i in x))}
pd.DataFrame(data)

   head  Details
1     1        5
2     2        6
3     3        7
4     4        8
5     5        9

   head  Details
a     1        5
b     2        6
c     3        7
d     4        8
e     5        9

In [13]:
data={"head":pd.Series([1,2,3,4,5]),
      "Details":pd.Series([5,6,7,8,9])}
pd.DataFrame(data)

   head  Details
0     1        5
1     2        6
2     3        7
3     4        8
4     5        9

In [14]:
import pandas as pd
df=pd.read_csv('student_marks.csv')

In [15]:
import pandas as pd
import numpy as np
arr=np.array([1,2,3,4])
marr=np.array([[1,2,3,3,4],[4,4,6,3,5]])
pdd=pd.Series(arr)
pddd=pd.DataFrame(marr)
print(pdd)
print(pddd)

0    1
1    2
2    3
3    4
dtype: int32
   0  1  2  3  4
0  1  2  3  3  4
1  4  4  6  3  5

In [16]:
dii={"Praveen":{"Kannada":95,"English":56,"Mathamatics":75,"Hindi":68,"Science":85,"Social Science":92}
     ,"Kavitha":{"Kannada":75,"English":65,"Mathamatics":89,"Hindi":75,"Science":54,"Social Science":75}
    ,"Keerthi":{"Kannada":75,"English":65,"Mathamatics":89,"Hindi":75,"Science":54,"Social Science":75}
    ,"Tejaswini":{"Kannada":75,"English":65,"Mathamatics":89,"Hindi":75,"Science":54,"Social Science":75}
    ,"Alexandra":{"Kannada":75,"English":65,"Mathamatics":89,"Hindi":75,"Science":54,"Social Science":75}
    ,"Pavithra":{"Kannada":75,"English":65,"Mathamatics":89,"Hindi":75,"Science":54,"Social Science":75}
    ,"Dhanya":{"Kannada":75,"English":65,"Mathamatics":89,"Hindi":75,"Science":54,"Social Science":75}}
pxx=pd.DataFrame(dii)
pxx

,Praveen,Kavitha,Keerthi,Tejaswini,Alexandra,Pavithra,Dhanya
Kannada,95,75,75,75,75,75,75
English,56,65,65,65,65,65,65
Mathamatics,75,89,89,89,89,89,89
Hindi,68,75,75,75,75,75,75
Science,85,54,54,54,54,54,54
Social Science,92,75,75,75,75,75,75

In [17]:
import pandas as pd
dxx={"S1":23,"S2":23,"S3":23,"S4":23,"S5":23,"S6":23}
px=pd.Series(dxx)
px

S1    23
S2    23
S3    23
S4    23
S5    23
S6    23
dtype: int64

In [18]:
ls=[1,2,3,4,4,5,6,7]
ds=pd.Series(ls)
df=pd.DataFrame(ds)
df

   0
0  1
1  2
2  3
3  4
4  4
5  5
6  6
7  7

In [19]:
dii={"Praveen":{"Kannada":95,"English":56,"Mathamatics":75,"Hindi":68,"Science":85,"Social Science":92}
     ,"Kavitha":{"Kannada":75,"English":65,"Mathamatics":89,"Hindi":75,"Science":54,"Social Science":75}
    ,"Keerthi":{"Kannada":75,"English":65,"Mathamatics":89,"Hindi":75,"Science":54,"Social Science":75}
    ,"Tejaswini":{"Kannada":75,"English":65,"Mathamatics":89,"Hindi":75,"Science":54,"Social Science":75}
    ,"Alexandra":{"Kannada":75,"English":65,"Mathamatics":89,"Hindi":75,"Science":54,"Social Science":75}
    ,"Pavithra":{"Kannada":75,"English":65,"Mathamatics":89,"Hindi":75,"Science":54,"Social Science":75}
    ,"Dhanya":{"Kannada":75,"English":65,"Mathamatics":89,"Hindi":75,"Science":54,"Social Science":75}}
pxx=pd.DataFrame(dii)
pxx

,Praveen,Kavitha,Keerthi,Tejaswini,Alexandra,Pavithra,Dhanya
Kannada,95,75,75,75,75,75,75
English,56,65,65,65,65,65,65
Mathamatics,75,89,89,89,89,89,89
Hindi,68,75,75,75,75,75,75
Science,85,54,54,54,54,54,54
Social Science,92,75,75,75,75,75,75

In [20]:
list2 = [{'Name': 'John','Age':25},{'Name':'Sam','Age':20},
         {'Name':'Eric','Age':30},{'Name':'Ken','Age':28}]
dataframe2=pd.DataFrame(list2)
print(dataframe2)

   Name  Age
0  John   25
1   Sam   20
2  Eric   30
3   Ken   28

In [21]:
list2 = [{'Name': ['John','Sam','Eric','Ken'],'Age':[25,20,30,28] }]
dataframe2=pd.DataFrame(list2)
print (dataframe2)

                     Name               Age
0  [John, Sam, Eric, Ken]  [25, 20, 30, 28]

In [22]:
import pandas as pd
list2 = [{'Name': 'John','Age':25}, {'Name':'Sam','Age':20},
         {'Name':'Eric','Age':30},{'Name':'Ken','Age':28}]
dataframe2=pd.DataFrame(list2)
print(dataframe2)

list2 = [['John','Sam','Eric','Ken'],[25,20,30,28] ]
dataframe2=pd.DataFrame(list2)

liss=[]
for x,i in enumerate(list2[0]):
    liss.append([i,list2[1][x]])
print(liss)
dataframe2=pd.DataFrame(liss)
print(dataframe2)

   Name  Age
0  John   25
1   Sam   20
2  Eric   30
3   Ken   28
[['John', 25], ['Sam', 20], ['Eric', 30], ['Ken', 28]]
      0   1
0  John  25
1   Sam  20
2  Eric  30
3   Ken  28

In [23]:
data1 = {'a': pd.Series ([10,11,12],index = ['a','b','c']),
         'b': pd.Series ([10,11,12,13],index = ['a','b','c','d'])}
tab1 = pd.DataFrame(data1)
print (tab1)
tab1 = pd.Series(data1)
print (tab1)

      a   b
a  10.0  10
b  11.0  11
c  12.0  12
d   NaN  13
a            a    10
b    11
c    12
dtype: int64
b    a    10
b    11
c    12
d    13
dtype: int64
dtype: object

In [24]:
data = {'one':pd.Series ([1,2,3], index = ['a','b','c']), 
        'two':pd.Series ([10,15,20,30], index = ['a','b','c','d']) }
Ser= pd.DataFrame(data)
Ser["three"]=pd.Series([1,2,34,4,5],index=['a','b','c','d','e'])
print(Ser)

   one  two  three
a  1.0   10      1
b  2.0   15      2
c  3.0   20     34
d  NaN   30      4

In [25]:
data = {'one':pd.Series ([1,2,3], index = ['a','b','c']), 
        'two':pd.Series ([10,15,20,30], index = ['a','b','c','d']) }
Ser= pd.DataFrame(data)
Ser['three'] = pd.Series ([10,20,50,60,70],index = ['a','b','c','d','e'])
print(Ser)

   one  two  three
a  1.0   10     10
b  2.0   15     20
c  3.0   20     50
d  NaN   30     60

In [26]:
Ser.iloc[[0,2]]

   one  two  three
a  1.0   10     10
c  3.0   20     50

In [27]:
aaa={'One':pd.Series([1,2,3,4],index=['A','B','C','D'])}
aaa['One']=pd.Series([1,2,3],index=['A','B','C'])
aaa['Two']=pd.Series([1,2,3,4],index=['A','B','C','D'])
aaa['Three']=pd.Series([1,2,3,4,5],index=['A','B','C','D','E'])
aaa['Three']=pd.Series([1,2,3,4,5],index=['D','B','C','A','E'])
aaa=pd.DataFrame(aaa)
aaa['Four']=pd.Series([10,20,30,40,50,60],index=['F','E','D','C','B','A'])
aaa['Five']=pd.Series([10,20,30,40,50,60],index=[1,2,3,4,5,6])
aaa

   One  Two  Three  Four  Five
A  1.0  1.0      4    60   NaN
B  2.0  2.0      2    50   NaN
C  3.0  3.0      3    40   NaN
D  NaN  4.0      1    30   NaN
E  NaN  NaN      5    20   NaN

In [28]:
aaa={'One':pd.Series([1,2,3,4])}
aaa['one']=pd.Series([1,2,3])
aaa['Two']=pd.Series([1,2,3,4])
aaa['Three']=pd.Series([1,2,3,4,5])
aaa['Three']=pd.Series([1,2,3,4,5])
df=pd.DataFrame(aaa)
df['six']=pd.Series([10,20,40,50,60,8])
df

   One  one  Two  Three  six
0  1.0  1.0  1.0      1   10
1  2.0  2.0  2.0      2   20
2  3.0  3.0  3.0      3   40
3  4.0  NaN  4.0      4   50
4  NaN  NaN  NaN      5   60

In [29]:
import pandas as pd
list2 = [{'Name': 'John','Age':25}, {'Name':'Sam','Age':20},
         {'Name':'Eric','Age':30},{'Name':'Ken','Age':28}]
dataframe2=pd.DataFrame(list2,index=['A','B','C','D'])
print(dataframe2[['Name','Age']])
print(dataframe2[dataframe2.columns[0::]])
print(dataframe2.loc['A':])
print(dataframe2.iloc[[1]])
a=dataframe2.index.values

   Name  Age
A  John   25
B   Sam   20
C  Eric   30
D   Ken   28
   Name  Age
A  John   25
B   Sam   20
C  Eric   30
D   Ken   28
   Name  Age
A  John   25
B   Sam   20
C  Eric   30
D   Ken   28
  Name  Age
B  Sam   20

In [30]:
list2 = [{'Name': 'John','Age':25}, {'Name':'Sam','Age':20},
         {"Last_Name":"Acharya",'Name':'Eric','Age':30},{'Name':'Ken','Age':28,"Last_Name":"Acharya"}]
dataframe2=pd.DataFrame(list2,index=['A','B','C','D'])
dataframe2.iloc[2:4,1:3]
dataframe2.loc['A':'D','Name':'Age']
dataframe2.columns.values

array(['Name', 'Age', 'Last_Name'], dtype=object)

In [31]:
import numpy as np
list2 = [{'Name': 'John','Age':25}, {'Name':'Sam','Age':20},
         {"Last_Name":"Acharya",'Name':'Eric','Age':30},{'Name':'Ken','Age':28,"Last_Name":"Acharya"}]
dataframe2=pd.DataFrame(list2,index=['A','B','C','D'])
dataframe2=dataframe2.append(pd.DataFrame([['Praveen',26,'Acharya'],
                                           ['Kavitha',25]],columns=['Name','Age',"Last_Name"],index=['E','F']))

g=dataframe2.columns.values
G=pd.DataFrame([['Tejaswini',22,'Acharya']],columns=dataframe2.columns,index=['G'])
dataframe2=dataframe2.append([G])
dataframe2

        Name  Age Last_Name
A       John   25       NaN
B        Sam   20       NaN
C       Eric   30   Acharya
D        Ken   28   Acharya
E    Praveen   26   Acharya
F    Kavitha   25      None
G  Tejaswini   22   Acharya

In [32]:
df=dataframe2.drop('D')
del(df['Last_Name'])
df

        Name  Age
A       John   25
B        Sam   20
C       Eric   30
E    Praveen   26
F    Kavitha   25
G  Tejaswini   22

In [33]:
import os
f_csv=pd.read_csv(r'E:\Batch 52- Day8\tips.csv')
print(os.getcwd())

C:\Users\Brain Hacker\Documents\Python Jupiter

In [34]:
f_csv.iloc[1:4,0:3]
a=f_csv.iloc[5:12,0:]
a.iloc[:,-1:]=[1,2,3,4,5,6,7]
a

    total_bill   tip     sex smoker  day    time  size
5        25.29  4.71    Male     No  Sun  Dinner     1
6         8.77  2.00    Male     No  Sun  Dinner     2
7        26.88  3.12    Male     No  NaN  Dinner     3
8        15.04  1.96    Male     No  Sun  Dinner     4
9        14.78  3.23    Male     No  Sun  Dinner     5
10       10.27  1.71    Male     No  Sun  Dinner     6
11       35.26  5.00  Female     No  NaN  Dinner     7

In [35]:
a.iloc[2:3,2:3]='Female'

In [36]:
a.iloc[1:3,1:3]=[['Hello','are'],['How','You']]
a.iloc[1:3,1:3]

     tip  sex
6  Hello  are
7    How  You

In [37]:
Student_Data = {'Student_id': ['AAA-123-2211','BBB-542-8542','CCC-854-8541','AAA-856-7458',
                               'DDD-745-7841'],
                'First_Name': ['Sam','Jim','Rick','Ben','Kevin'],
               'Last_Name': ['Edison','Mon','Dany','Denil','Pocket']}
student= pd.DataFrame (Student_Data, columns = ['Student_id','First_Name','Last_Name'])
print (student)

     Student_id First_Name Last_Name
0  AAA-123-2211        Sam    Edison
1  BBB-542-8542        Jim       Mon
2  CCC-854-8541       Rick      Dany
3  AAA-856-7458        Ben     Denil
4  DDD-745-7841      Kevin    Pocket

In [38]:
Student_Course= {'St_id':['AAA-123-2211','BBB-542-8542','CCC-854-7458','AAA-856-7458',
                               'DDD-745-7841'],'course':['ML','DS','RPA','BI','DL'],
                 'duration':[3,4,2,5,2]}
course = pd.DataFrame(Student_Course)
print(course)

          St_id course  duration
0  AAA-123-2211     ML         3
1  BBB-542-8542     DS         4
2  CCC-854-7458    RPA         2
3  AAA-856-7458     BI         5
4  DDD-745-7841     DL         2

In [39]:
a=pd.concat([student,course],axis=1)
a

     Student_id First_Name Last_Name         St_id course  duration
0  AAA-123-2211        Sam    Edison  AAA-123-2211     ML         3
1  BBB-542-8542        Jim       Mon  BBB-542-8542     DS         4
2  CCC-854-8541       Rick      Dany  CCC-854-7458    RPA         2
3  AAA-856-7458        Ben     Denil  AAA-856-7458     BI         5
4  DDD-745-7841      Kevin    Pocket  DDD-745-7841     DL         2

In [40]:
pd.merge(student,course,left_on='Student_id',right_on='St_id',how='inner')

     Student_id First_Name Last_Name         St_id course  duration
0  AAA-123-2211        Sam    Edison  AAA-123-2211     ML         3
1  BBB-542-8542        Jim       Mon  BBB-542-8542     DS         4
2  AAA-856-7458        Ben     Denil  AAA-856-7458     BI         5
3  DDD-745-7841      Kevin    Pocket  DDD-745-7841     DL         2

In [41]:
pd.merge(student,course,left_on='Student_id',right_on='St_id',how='left')

     Student_id First_Name Last_Name         St_id course  duration
0  AAA-123-2211        Sam    Edison  AAA-123-2211     ML       3.0
1  BBB-542-8542        Jim       Mon  BBB-542-8542     DS       4.0
2  CCC-854-8541       Rick      Dany           NaN    NaN       NaN
3  AAA-856-7458        Ben     Denil  AAA-856-7458     BI       5.0
4  DDD-745-7841      Kevin    Pocket  DDD-745-7841     DL       2.0

In [42]:
pd.merge(student,course,left_on='Student_id',right_on='St_id',how='right')

     Student_id First_Name Last_Name         St_id course  duration
0  AAA-123-2211        Sam    Edison  AAA-123-2211     ML         3
1  BBB-542-8542        Jim       Mon  BBB-542-8542     DS         4
2           NaN        NaN       NaN  CCC-854-7458    RPA         2
3  AAA-856-7458        Ben     Denil  AAA-856-7458     BI         5
4  DDD-745-7841      Kevin    Pocket  DDD-745-7841     DL         2

In [43]:
pd.merge(student,course,left_on='Student_id',right_on='St_id',how='outer')

     Student_id First_Name Last_Name         St_id course  duration
0  AAA-123-2211        Sam    Edison  AAA-123-2211     ML       3.0
1  BBB-542-8542        Jim       Mon  BBB-542-8542     DS       4.0
2  CCC-854-8541       Rick      Dany           NaN    NaN       NaN
3  AAA-856-7458        Ben     Denil  AAA-856-7458     BI       5.0
4  DDD-745-7841      Kevin    Pocket  DDD-745-7841     DL       2.0
5           NaN        NaN       NaN  CCC-854-7458    RPA       2.0

In [44]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({
	'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub3','sub4','sub3','sub6','sub5']})
print (left)
print ('\n')
print (right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub3
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [45]:
pd.merge(left,right,on=['id','subject_id'],how='inner')

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

In [46]:
pd.merge(left,right,on=['id','subject_id'],how='left')

   id  Name_x subject_id Name_y
0   1    Alex       sub1    NaN
1   2     Amy       sub2    NaN
2   3   Allen       sub4    NaN
3   4   Alice       sub6  Bryce
4   5  Ayoung       sub5  Betty

In [47]:
pd.merge(left,right,on=['id','subject_id'],how='right')

   id  Name_x subject_id Name_y
0   1     NaN       sub3  Billy
1   2     NaN       sub4  Brian
2   3     NaN       sub3   Bran
3   4   Alice       sub6  Bryce
4   5  Ayoung       sub5  Betty

In [48]:
a=pd.merge(left,right,on=['id','subject_id'],how='outer')
a.iloc[0:3,3:]=0
a.loc[5:,:'Name_x']=0
a['id']=[i for i in range(1,len(a['id'])+1)]
display(a)

   id  Name_x subject_id Name_y
0   1    Alex       sub1      0
1   2     Amy       sub2      0
2   3   Allen       sub4      0
3   4   Alice       sub6  Bryce
4   5  Ayoung       sub5  Betty
5   6       0       sub3  Billy
6   7       0       sub4  Brian
7   8       0       sub3   Bran

In [3]:
import numpy as np,pandas as pd,os
os.chdir('E:\\Batch 52- Day8\\')

In [4]:
stats=pd.read_csv(r'DemographicData.csv')

In [51]:
len(stats)

195

In [52]:
stats.columns

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')

In [53]:
stats[[stats.columns[1]]]

    Country Code
0            ABW
1            AFG
2            AGO
3            ALB
4            ARE
..           ...
190          YEM
191          ZAF
192          COD
193          ZMB
194          ZWE

[195 rows x 1 columns]

In [54]:
len(stats.columns)

5

In [55]:
stats.shape

(195, 5)

In [56]:
stats.head()

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [57]:
stats.tail()

,Country Name,Country Code,Birth rate,Internet users,Income Group
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [58]:
stats.head(5)

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [59]:
stats.tail(7)

,Country Name,Country Code,Birth rate,Internet users,Income Group
188,West Bank and Gaza,PSE,30.394,46.6,Lower middle income
189,Samoa,WSM,26.172,15.3,Lower middle income
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [60]:
stats.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country Name    195 non-null    object
 1   Country Code    195 non-null    object
 2   Birth rate      195 non-null    float64
 3   Internet users  195 non-null    float64
 4   Income Group    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 7.7+ KB

In [61]:
stats.describe()

       Birth rate  Internet users
count  195.000000      195.000000
mean    21.469928       42.076471
std     10.605467       29.030788
min      7.900000        0.900000
25%     12.120500       14.520000
50%     19.680000       41.000000
75%     29.759500       66.225000
max     49.661000       96.546800

In [62]:
stats['Total']=stats['Birth rate']+stats['Internet users']
del[stats['Total']]
stats.head()

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [63]:
stats1=stats.rename(columns={"Country Code":"c_code"},inplace=False)
stats1=stats1.rename(columns={'Birth rate':'B_rate','Internet users':'I_user'})
stats1['Total']=stats1.B_rate+stats1.I_user
stats1

             Country Name c_code  B_rate  I_user         Income Group   Total
0                   Aruba    ABW  10.244    78.9          High income  89.144
1             Afghanistan    AFG  35.253     5.9           Low income  41.153
2                  Angola    AGO  45.985    19.1  Upper middle income  65.085
3                 Albania    ALB  12.877    57.2  Upper middle income  70.077
4    United Arab Emirates    ARE  11.044    88.0          High income  99.044
..                    ...    ...     ...     ...                  ...     ...
190           Yemen, Rep.    YEM  32.947    20.0  Lower middle income  52.947
191          South Africa    ZAF  20.850    46.5  Upper middle income  67.350
192      Congo, Dem. Rep.    COD  42.394     2.2           Low income  44.594
193                Zambia    ZMB  40.471    15.4  Lower middle income  55.871
194              Zimbabwe    ZWE  35.715    18.5           Low income  54.215

[195 rows x 6 columns]

In [64]:
stats1=stats1.drop('Total',axis=1)
stats1=stats1.drop('I_user',axis=1)
stats1=stats1.drop('B_rate',axis=1)
stats1

             Country Name c_code         Income Group
0                   Aruba    ABW          High income
1             Afghanistan    AFG           Low income
2                  Angola    AGO  Upper middle income
3                 Albania    ALB  Upper middle income
4    United Arab Emirates    ARE          High income
..                    ...    ...                  ...
190           Yemen, Rep.    YEM  Lower middle income
191          South Africa    ZAF  Upper middle income
192      Congo, Dem. Rep.    COD           Low income
193                Zambia    ZMB  Lower middle income
194              Zimbabwe    ZWE           Low income

[195 rows x 3 columns]

In [89]:
stats2

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [101]:
stats2=stats2.rename(columns={"Birth rate":'B_rate'})
stats2.head()

,Country Name,Country Code,B_rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [108]:
stats2[(stats2['Internet users']>20) & (stats2['B_rate']>20)]

,Country Name,Country Code,B_rate,Internet users,Income Group
21,Belize,BLZ,23.092,33.600000,Upper middle income
23,Bolivia,BOL,24.236,36.940000,Lower middle income
39,Cabo Verde,CPV,21.625,37.500000,Lower middle income
48,Dominican Republic,DOM,21.198,45.900000,Upper middle income
50,Ecuador,ECU,21.070,40.353684,Upper middle income
51,"Egypt, Arab Rep.",EGY,28.032,29.400000,Lower middle income
57,Fiji,FJI,20.463,37.100000,Upper middle income
59,"Micronesia, Fed. Sts.",FSM,23.511,27.800000,Lower middle income
85,Israel,ISR,21.300,70.800000,High income
88,Jordan,JOR,27.046,41.000000,Upper middle income
90,Kazakhstan,KAZ,22.730,54.000000,Upper middle income
91,Kenya,KEN,35.194,39.000000,Lower middle income
92,Kyrgyz Republic,KGZ,27.200,23.000000,Lower middle income
96,Kuwait,KWT,20.575,75.460000,High income
109,Morocco,MAR,21.023,56.000000,Lower middle income
112,Maldives,MDV,21.447,44.100000,Upper middle income
128,Nigeria,NGA,40.045,38.000000,Lower middle income
134,Oman,OMN,20.419,66.450000,High income
137,Peru,PER,20.198,39.200000,Upper middle income
138,Philippines,PHL,23.790,37.000000,Lower middle income
143,Paraguay,PRY,21.588,36.900000,Upper middle income
149,Saudi Arabia,SAU,20.576,60.500000,High income
150,Sudan,SDN,33.477,22.700000,Lower middle income
159,Sao Tome and Principe,STP,34.537,23.000000,Lower middle income
164,Swaziland,SWZ,30.093,24.700000,Lower middle income
166,Syrian Arab Republic,SYR,24.043,26.200000,Lower middle income
173,Tonga,TON,25.409,35.000000,Upper middle income
182,Uzbekistan,UZB,22.500,38.200000,Lower middle income
188,West Bank and Gaza,PSE,30.394,46.600000,Lower middle income
191,South Africa,ZAF,20.850,46.500000,Upper middle income

In [112]:
stats2[stats2['Income Group']=='High income']

              Country Name Country Code  B_rate  Internet users Income Group
0                    Aruba          ABW  10.244           78.90  High income
4     United Arab Emirates          ARE  11.044           88.00  High income
5                Argentina          ARG  17.716           59.90  High income
7      Antigua and Barbuda          ATG  16.447           63.40  High income
8                Australia          AUS  13.200           83.00  High income
..                     ...          ...     ...             ...          ...
174    Trinidad and Tobago          TTO  14.590           63.80  High income
180                Uruguay          URY  14.374           57.69  High income
181          United States          USA  12.500           84.20  High income
184          Venezuela, RB          VEN  19.842           54.90  High income
185  Virgin Islands (U.S.)          VIR  10.700           45.30  High income

[67 rows x 5 columns]

In [113]:
stats2[stats2['Income Group']=='Low income']

,Country Name,Country Code,B_rate,Internet users,Income Group
1,Afghanistan,AFG,35.253,5.90,Low income
11,Burundi,BDI,44.151,1.30,Low income
13,Benin,BEN,36.440,4.90,Low income
14,Burkina Faso,BFA,40.551,9.10,Low income
29,Central African Republic,CAF,34.076,3.50,Low income
38,Comoros,COM,34.326,6.50,Low income
52,Eritrea,ERI,34.800,0.90,Low income
55,Ethiopia,ETH,32.925,1.90,Low income
64,Guinea,GIN,37.337,1.60,Low income
65,"Gambia, The",GMB,42.525,14.00,Low income
66,Guinea-Bissau,GNB,37.503,3.10,Low income
77,Haiti,HTI,25.345,10.60,Low income
93,Cambodia,KHM,24.462,6.80,Low income
99,Liberia,LBR,35.521,3.20,Low income
111,Madagascar,MDG,34.686,3.00,Low income
115,Mali,MLI,44.138,3.50,Low income
120,Mozambique,MOZ,39.705,5.40,Low income
123,Malawi,MWI,39.459,5.05,Low income
127,Niger,NER,49.661,1.70,Low income
132,Nepal,NPL,20.923,13.30,Low income
148,Rwanda,RWA,32.689,9.00,Low income
154,Sierra Leone,SLE,36.729,1.70,Low income
156,Somalia,SOM,43.891,1.50,Low income
158,South Sudan,SSD,37.126,14.10,Low income
167,Chad,TCD,45.745,2.30,Low income
168,Togo,TGO,36.080,4.50,Low income
177,Tanzania,TZA,39.518,4.40,Low income
178,Uganda,UGA,43.474,16.20,Low income
192,"Congo, Dem. Rep.",COD,42.394,2.20,Low income
194,Zimbabwe,ZWE,35.715,18.50,Low income

In [114]:
stats2['Income Group'].unique()

array(['High income', 'Low income', 'Upper middle income',
       'Lower middle income'], dtype=object)

In [116]:
stats2['Income Group'].value_counts()

High income            67
Lower middle income    50
Upper middle income    48
Low income             30
Name: Income Group, dtype: int64

In [118]:
stats2['Income Group'].count()

195

In [6]:
stats2=stats

In [8]:
stats2.head()

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income

In [10]:
stats2.rename(columns={'Birth rate':'B_rate'})

,Country Name,Country Code,B_rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [18]:
stats2=stats2.rename(columns={'Income Group':'I_group'})

In [24]:
stats2[(stats2.I_group=='Low income')]

,Country Name,Country Code,Birth rate,Internet users,I_group
1,Afghanistan,AFG,35.253,5.90,Low income
11,Burundi,BDI,44.151,1.30,Low income
13,Benin,BEN,36.440,4.90,Low income
14,Burkina Faso,BFA,40.551,9.10,Low income
29,Central African Republic,CAF,34.076,3.50,Low income
38,Comoros,COM,34.326,6.50,Low income
52,Eritrea,ERI,34.800,0.90,Low income
55,Ethiopia,ETH,32.925,1.90,Low income
64,Guinea,GIN,37.337,1.60,Low income
65,"Gambia, The",GMB,42.525,14.00,Low income
66,Guinea-Bissau,GNB,37.503,3.10,Low income
77,Haiti,HTI,25.345,10.60,Low income
93,Cambodia,KHM,24.462,6.80,Low income
99,Liberia,LBR,35.521,3.20,Low income
111,Madagascar,MDG,34.686,3.00,Low income
115,Mali,MLI,44.138,3.50,Low income
120,Mozambique,MOZ,39.705,5.40,Low income
123,Malawi,MWI,39.459,5.05,Low income
127,Niger,NER,49.661,1.70,Low income
132,Nepal,NPL,20.923,13.30,Low income
148,Rwanda,RWA,32.689,9.00,Low income
154,Sierra Leone,SLE,36.729,1.70,Low income
156,Somalia,SOM,43.891,1.50,Low income
158,South Sudan,SSD,37.126,14.10,Low income
167,Chad,TCD,45.745,2.30,Low income
168,Togo,TGO,36.080,4.50,Low income
177,Tanzania,TZA,39.518,4.40,Low income
178,Uganda,UGA,43.474,16.20,Low income
192,"Congo, Dem. Rep.",COD,42.394,2.20,Low income
194,Zimbabwe,ZWE,35.715,18.50,Low income

In [23]:
statsaa

,Country Name,Country Code,Birth rate,Internet users,I_group
1,Afghanistan,AFG,35.253,5.90,Low income
11,Burundi,BDI,44.151,1.30,Low income
13,Benin,BEN,36.440,4.90,Low income
14,Burkina Faso,BFA,40.551,9.10,Low income
29,Central African Republic,CAF,34.076,3.50,Low income
38,Comoros,COM,34.326,6.50,Low income
52,Eritrea,ERI,34.800,0.90,Low income
55,Ethiopia,ETH,32.925,1.90,Low income
64,Guinea,GIN,37.337,1.60,Low income
65,"Gambia, The",GMB,42.525,14.00,Low income
66,Guinea-Bissau,GNB,37.503,3.10,Low income
77,Haiti,HTI,25.345,10.60,Low income
93,Cambodia,KHM,24.462,6.80,Low income
99,Liberia,LBR,35.521,3.20,Low income
111,Madagascar,MDG,34.686,3.00,Low income
115,Mali,MLI,44.138,3.50,Low income
120,Mozambique,MOZ,39.705,5.40,Low income
123,Malawi,MWI,39.459,5.05,Low income
127,Niger,NER,49.661,1.70,Low income
132,Nepal,NPL,20.923,13.30,Low income
148,Rwanda,RWA,32.689,9.00,Low income
154,Sierra Leone,SLE,36.729,1.70,Low income
156,Somalia,SOM,43.891,1.50,Low income
158,South Sudan,SSD,37.126,14.10,Low income
167,Chad,TCD,45.745,2.30,Low income
168,Togo,TGO,36.080,4.50,Low income
177,Tanzania,TZA,39.518,4.40,Low income
178,Uganda,UGA,43.474,16.20,Low income
192,"Congo, Dem. Rep.",COD,42.394,2.20,Low income
194,Zimbabwe,ZWE,35.715,18.50,Low income

In [66]:
♦

SyntaxError: invalid character in identifier (<ipython-input-66-c4c1078c0ba8>, line 1)